; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l15_p15_c15_g15_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(person-at person1 loc13)
	(person-at person2 loc6)
	(person-at person3 loc4)
	(person-at person4 loc6)
	(person-at person5 loc13)
	(person-at person6 loc6)
	(person-at person7 loc8)
	(person-at person8 loc12)
	(person-at person9 loc5)
	(person-at person10 loc13)
	(person-at person11 loc6)
	(person-at person12 loc2)
	(person-at person13 loc12)
	(person-at person14 loc4)
	(person-at person15 loc13)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person5 medicine)
	(has-content-person person6 food)
	(has-content-person person6 medicine)
	(has-content-person person9 food)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person13 medicine)
	(has-content-person person14 food)
	(has-content-person person14 medicine)
	(has-content-person person15 medicine)
))
)

; plan
1. (put-crate-in-carrier crate15 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate15 depot)
   added: (crate-at-space crate15 carrier1 space4)
   goals met: 1 of 16
2. (put-crate-in-carrier crate6 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space3)
   goals met: 1 of 16
3. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 0 of 16
4. (pick-and-drop crate15 loc12 drone1 carrier1 space4 person13 medicine)
   deleted: (crate-at-space crate15 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person13 medicine)
   goals met: 1 of 16
5. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 16
6. (put-crate-in-carrier crate14 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space4)
   goals met: 2 of 16
7. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 1 of 16
8. (pick-and-drop crate6 loc5 drone1 carrier1 space3 person9 food)
   deleted: (crate-at-space crate6 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person9 food)
   goals met: 2 of 16
9. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 16
10. (put-crate-in-carrier crate5 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space3)
   goals met: 3 of 16
11. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 2 of 16
12. (pick-and-drop crate14 loc2 drone1 carrier1 space4 person12 medicine)
   deleted: (crate-at-space crate14 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person12 medicine)
   goals met: 3 of 16
13. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 16
14. (put-crate-in-carrier crate13 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space4)
   goals met: 4 of 16
15. (put-crate-in-carrier crate12 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space2)
   goals met: 4 of 16
16. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 3 of 16
17. (pick-and-drop crate12 loc13 drone1 carrier1 space2 person5 medicine)
   deleted: (crate-at-space crate12 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person5 medicine)
   goals met: 4 of 16
18. (pick-and-drop crate5 loc13 drone1 carrier1 space3 person1 food)
   deleted: (crate-at-space crate5 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person1 food)
   goals met: 5 of 16
19. (pick-and-drop crate13 loc13 drone1 carrier1 space4 person15 medicine)
   deleted: (crate-at-space crate13 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person15 medicine)
   goals met: 6 of 16
20. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 16
21. (put-crate-in-carrier crate11 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space4)
   goals met: 7 of 16
22. (put-crate-in-carrier crate4 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space3)
   goals met: 7 of 16
23. (put-crate-in-carrier crate10 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space2)
   goals met: 7 of 16
24. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 6 of 16
25. (pick-and-drop crate10 loc6 drone1 carrier1 space2 person2 medicine)
   deleted: (crate-at-space crate10 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person2 medicine)
   goals met: 7 of 16
26. (pick-and-drop crate4 loc6 drone1 carrier1 space3 person2 food)
   deleted: (crate-at-space crate4 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person2 food)
   goals met: 8 of 16
27. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 16
28. (put-crate-in-carrier crate3 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space3)
   goals met: 9 of 16
29. (put-crate-in-carrier crate9 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space2)
   goals met: 9 of 16
30. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 8 of 16
31. (pick-and-drop crate9 loc6 drone1 carrier1 space2 person6 medicine)
   deleted: (crate-at-space crate9 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person6 medicine)
   goals met: 9 of 16
32. (pick-and-drop crate3 loc6 drone1 carrier1 space3 person4 food)
   deleted: (crate-at-space crate3 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person4 food)
   goals met: 10 of 16
33. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 16
34. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 11 of 16
35. (put-crate-in-carrier crate8 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space2)
   goals met: 11 of 16
36. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 10 of 16
37. (pick-and-drop crate8 loc6 drone1 carrier1 space2 person11 medicine)
   deleted: (crate-at-space crate8 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person11 medicine)
   goals met: 11 of 16
38. (pick-and-drop crate2 loc6 drone1 carrier1 space3 person6 food)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person6 food)
   goals met: 12 of 16
39. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 13 of 16
40. (put-crate-in-carrier crate1 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space3)
   goals met: 13 of 16
41. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 12 of 16
42. (pick-and-drop crate1 loc4 drone1 carrier1 space3 person14 food)
   deleted: (crate-at-space crate1 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person14 food)
   goals met: 13 of 16
43. (pick-and-drop crate11 loc4 drone1 carrier1 space4 person3 medicine)
   deleted: (crate-at-space crate11 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person3 medicine)
   goals met: 14 of 16
44. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 16
45. (put-crate-in-carrier crate7 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space4)
   goals met: 15 of 16
46. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 14 of 16
47. (pick-and-drop crate7 loc4 drone1 carrier1 space4 person14 medicine)
   deleted: (crate-at-space crate7 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person14 medicine)
   goals met: 15 of 16
48. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 16 of 16
